Revit 2026 API

# RadioButtonGroupCurrent Property

---

Gets or sets the current checked ToggleButton of the RadioButtonGroup.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ToggleButton Current { get; set; }
```
```vb
Public Property Current As ToggleButton
	Get
	Set
```
```cpp
public:
property ToggleButton^ Current {
	ToggleButton^ get ();
	void set (ToggleButton^ value);
}
```
```fsharp
member Current : ToggleButton with get, set
```

#### Property Value

ToggleButton

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when trying to set this property to . |
| ArgumentException | Thrown when trying to set this property to a button not in this group. |

The default value is the first ToggleButton added to the group. When using this property to set the current ToggleButton, the external command of that button will not be called.

#### Reference

RadioButtonGroup Class

Autodesk.Revit.UI Namespace